day2/6_taylorCouetteFlow/taylor_couette_base/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       latestTime;

stopAt          endTime;

endTime         25000;

deltaT          1;

writeControl    runTime;

writeInterval   400;

purgeWrite      0;

writeFormat     ascii;

writePrecision  9;

writeCompression yes;

timeFormat      general;

timePrecision   9;

runTimeModifiable no;


// ************************************************************************* //
